app/controllers/admin_controller.rb

          @sommatoria_prezzo_totale += rapporto.prezzo_totale
          @conteggio_tipologie[rapporto.tipologia.id] = (@conteggio_tipologie[rapporto.tipologia.id] || 0) + 1
          unless rapporto.tipologia.forfeit
            rapporto.tipologia.prove.each do |prova|
---
SELECT `prove`.* FROM `prove` INNER JOIN `prova_tipologia_items` ON `prove`.id = `prova_tipologia_items`.prova_id WHERE ((`prova_tipologia_items`.tipologia_id = 12))

  def dati_rapporto
    @rapporto = Rapporto.find(params[:id])
    if params[:azione] == 'ricalcola'
      @rapporto.calcola
      @rapporto.reload
      flash[:notice] = 'Rapporto ricalcolato'
    end
    if params[:azione] == 'attualizza_prezzo'
      @rapporto.attualizza_prezzo
      flash[:notice] = 'Prezzo aggiornato con i valori attuali'
    end
    # rapporto.prove[0].variabili    sono le variabili che devo visualizzare del rapporto
    variabili_da_visualizzare = @rapporto.prove_totali.map {|prova| prova.variabili}.flatten.uniq
      @variabile_rapporto_items = @rapporto.variabile_rapporto_items.clone # clone necessario, altrimenti con i delete MODIFICO @rapporto (anche se non lo salvo)
    case params[:filtro]
    when 'solo_dati_visualizzati'
      unless @variabile_rapporto_items.nil?
        @variabile_rapporto_items.delete_if { |variabile_rapporto_item| !variabili_da_visualizzare.include? variabile_rapporto_item.variabile }
---
SELECT `prove`.* FROM `prove` INNER JOIN `prova_tipologia_items` ON `prove`.id = `prova_tipologia_items`.prova_id WHERE ((`prova_tipologia_items`.tipologia_id = 1))
SELECT `variabili`.* FROM `variabili` INNER JOIN `prova_variabile_items` ON `variabili`.id = `prova_variabile_items`.variabile_id WHERE ((`prova_variabile_items`.prova_id = 1))
SELECT * FROM `prova_rapporto_items` WHERE (`prova_rapporto_items`.rapporto_id = 5) ORDER BY position ASC
SELECT * FROM `variabile_rapporto_items` WHERE (`variabile_rapporto_items`.rapporto_id = 5)

  def _dati_rapporto_variabile_ajax_form
    @variabile_rapporto_item = VariabileRapportoItem.find(params[:id])
    if @variabile_rapporto_item.variabile.tipo == 'input-testo'
      @variabile_rapporto_item.valore_testo  = params[:valore]
    else
      @variabile_rapporto_item.valore_numero = params[:valore]
    end
    if @variabile_rapporto_item.save
---
SELECT * FROM `udm_items` WHERE (`udm_items`.`id` = 4)
SELECT `variabile_rapporto_items`.id FROM `variabile_rapporto_items` WHERE (`variabile_rapporto_items`.`variabile_id` = 123 AND `variabile_rapporto_items`.rapporto_id = 483 AND `variabile_rapporto_items`.id <> 6813) LIMIT 1
UPDATE `variabile_rapporto_items` SET `updated_at` = '2025-10-27 17:11:32', `errore` = '2 simboli mancanti' WHERE `id` = 6808

  def _dati_rapporto_incertezza_di_misura_ajax_form
    @variabile_rapporto_item = VariabileRapportoItem.find(params[:id])
    @variabile_rapporto_item.incertezza_di_misura = params[:incertezza_di_misura]
    if @variabile_rapporto_item.save
---
SELECT `variabile_rapporto_items`.id FROM `variabile_rapporto_items` WHERE (`variabile_rapporto_items`.`variabile_id` = 240 AND `variabile_rapporto_items`.rapporto_id = 483 AND `variabile_rapporto_items`.id <> 6814) LIMIT 1
UPDATE `variabile_rapporto_items` SET `updated_at` = '2025-10-27 17:11:48', `incertezza_di_misura` = 'un po\'' WHERE `id` = 6814


    # PROVE
    # prove delle tipologie non a forfeit
    prove_delle_tipologie_non_a_forfeit = Tipologia.find(:all,:conditions => {:forfeit => false}).map{|tipologia| tipologia.prove}
    # prove aggiuntive (prendo solo quelle che sono utilizzate)
    prove_aggiuntive = ProvaRapportoItem.all.map{|prova_rapporto_item| prova_rapporto_item.prova }
---
SELECT `prove`.* FROM `prove` INNER JOIN `prova_tipologia_items` ON `prove`.id = `prova_tipologia_items`.prova_id WHERE ((`prova_tipologia_items`.tipologia_id = 7))
SELECT * FROM `auto_prova_rapporto_items` WHERE (`auto_prova_rapporto_items`.rapporto_id = 1) ORDER BY id ASC
SELECT * FROM `prova_rapporto_items` WHERE (`prova_rapporto_items`.rapporto_id = 1) ORDER BY position ASC

      # PROVE
      else
        if rapporto.fattura
          rapporto.tipologia.prove.each{|prova| @numero_prove[prova.id][0] += 1}
---
SELECT * FROM `prove`