app/controllers/rapporti_controller.rb

  def stampa_dati
    @rapporto = Rapporto.find(params[:id])
    @variabile_rapporto_items = @rapporto.variabile_rapporto_items.clone # clone necessario, altrimenti con i delete MODIFICO @rapporto (anche se non lo salvo)
    @variabile_rapporto_items_solo_funzioni = @variabile_rapporto_items.clone # clone necessario, altrimenti con i delete MODIFICO @rapporto (anche se non lo salvo)
    # Estrai le sole funzioni
    @variabile_rapporto_items_solo_funzioni.delete_if { |variabile_rapporto_item| variabile_rapporto_item.variabile.tipo != 'funzione' }
    @variabile_rapporto_items_ordinate = []
    @variabile_rapporto_items.each do |variabile_rapporto_item|
      @variabile_rapporto_items_ordinate << variabile_rapporto_item
      variabile_rapporto_item.variabile.variabili_indipendenti.each do |variabile|
---
SELECT * FROM `prova_rapporto_items` WHERE (`prova_rapporto_items`.rapporto_id = 479) ORDER BY position ASC
SELECT * FROM `variabile_rapporto_items` WHERE (`variabile_rapporto_items`.rapporto_id = 479)
SELECT `variabili`.* FROM `variabili` INNER JOIN `prova_variabile_items` ON `variabili`.id = `prova_variabile_items`.variabile_id WHERE ((`prova_variabile_items`.prova_id = 42))

  def anteprima_risultati
    if params[:rapporty_array].nil? || params[:rapporty_array].empty?
      flash[:error] = "Non hai selezionato alcun rapporto"
      redirect_to :controller => :admin, :action => :cerca_rapporti
      return
    else
      begin
        @rapporti = params[:rapporty_array].map{|rapporto_id| Rapporto.find_by_id(rapporto_id.to_i)}.compact

        # Se non ci sono rapporti validi, mostra un errore
        if @rapporti.empty?
          flash[:error] = "Nessun rapporto valido selezionato"
          redirect_to :controller => :admin, :action => :cerca_rapporti
          return
        end

        # ordino per numero di Rdp (mettendo per primi quelli che non lo hanno)
        @rapporti.sort! {|x,y| (y.numero||0) <=> (x.numero||0) }

        # calcolo le variabili da mostrare (le colonne)
        @variabili = []
        @rapporti.each do |rapporto|
          # rapporto.prove[0].variabili sono le variabili che devo visualizzare del rapporto
          variabili_da_visualizzare = rapporto.prove_totali.map {|prova| prova.variabili}.flatten.uniq rescue []
---
SELECT `prove`.* FROM `prove` INNER JOIN `prova_tipologia_items` ON `prove`.id = `prova_tipologia_items`.prova_id WHERE ((`prova_tipologia_items`.tipologia_id = 1))
SELECT `variabili`.* FROM `variabili` INNER JOIN `prova_variabile_items` ON `variabili`.id = `prova_variabile_items`.variabile_id WHERE ((`prova_variabile_items`.prova_id = 1))
SELECT count(*) AS count_all FROM `variabili` INNER JOIN `prova_variabile_items` ON `variabili`.id = `prova_variabile_items`.variabile_id WHERE ((`prova_variabile_items`.prova_id = 95))

        @rapporti.each do |rapporto|
          @tabella[riga] = Hash.new
          begin
            rapporto.variabile_rapporto_items.each do |variabile_rapporto_item|
---
SELECT * FROM `variabile_rapporto_items` WHERE (`variabile_rapporto_items`.rapporto_id = 1)